{
  "basics": {
    "name": "Ashish Kushwaha",
    "title": "DevOps / Software Developer Engineer",
    "summery": "A passionate and self-driven Software Developer and Computer Science dual-degree (B.Tech + M.Tech) student with an 8.5 CGPA, I bring a robust background in full-stack web development, specializing in efficient, scalable, and user-focused applications using modern JavaScript frameworks (React, Svelte), Tailwind CSS, and Chrome Extension APIs. I've led end-to-end product development, notably HireLift—an AI-driven Chrome extension.",
    "tags": [
      "open source",
      "aws",
      "Arch Linux",
      "Web Development",
      "C++",
      "Bash Scripting",
      "JavaScript",
      "MERN"
    ],
    "resume": "https://ashishkus-resume.s3.ap-south-1.amazonaws.com/Ashish_Kushwaha.pdf",
    "blog": "https://0xblogs.ashishkus.com/",
    "email": "ashish.kus2408@gmail.com",
    "phone": "+91 7525874187",
    "github": "https://github.com/ashish-kus",
    "linkedin": "https://www.linkedin.com/in/ashish-kushwaha2408",
    "telegram": "https://t.me/ashishk2408",
    "whatsapp": "https://wa.me/917525874187",
    "x": "https://x.com/AshishKus2408",
    "instagram": "https://www.instagram.com/_ashish_kushwaha_/",
    "portfolio": "https://ashishkus.com"
  },

  "education": [
    {
      "institution": "Gautam Buddha University",
      "location": "Greater Noida, Uttar Pradesh",
      "degree": "B. Tech + M. Tech CSE in Software Engineering",
      "cgpa": "8.5",
      "dates": "August 2020 – Present"
    },
    {
      "institution": "Narayana IIT Academy, Raviryala",
      "location": "Hyderabad, Telangana",
      "degree": "Intermediate – Physics, Chemistry, Mathematics",
      "percentage": "88%",
      "dates": "March 2017 – March 2019"
    }
  ],

  "experience": [
    {
      "title": "Software Development Engineer",
      "company": "Arial Labs",
      "type": "Remote",
      "duration": "June 2024 – April 2025",
      "location": "California",
      "description": "Contributed to core product development, starting with React.js static pages and advancing to building a Chrome extension with Manifest V3. Integrated Claude API with AWS Lambda, DynamoDB, and S3 for scalable AI features. Deployed MVP with a dashboard to track user activity and internal operations.",
      "skills": [
        "React.js",
        "Tailwind CSS",
        "Chrome Extension",
        "Claude API",
        "AWS Lambda",
        "DynamoDB",
        "S3",
        "GitHub",
        "Serverless"
      ]
    },
    {
      "title": "Internship Trainee",
      "company": "Samsung Innovation Campus",
      "type": "Full-time",
      "duration": "Jun 2024 – Sep 2024 · 4 mos",
      "location": "Greater Noida, On-site",
      "description": "Completed intensive AI training focused on real-world applications of Artificial Intelligence and Data Science. Worked on practical AI projects involving machine learning, classification, and predictive modeling. Conducted ETL, EDA, and built dashboards using Power BI and Excel.",
      "skills": [
        "Machine Learning",
        "Python",
        "TensorFlow",
        "PyTorch",
        "Data Analysis",
        "Power BI",
        "Excel",
        "EDA",
        "ETL",
        "AI"
      ]
    },
    {
      "title": "Web Developer Intern",
      "company": "Gautam Buddha University",
      "type": "In-campus",
      "duration": "March 2023 – June 2023",
      "location": "Greater Noida",
      "description": "Designed and developed a job applicant tracking frontend using the MERN stack. Worked with the Registrar’s Office to gather requirements and deliver feature-driven updates that streamlined university hiring.",
      "skills": [
        "MERN Stack",
        "React.js",
        "MongoDB",
        "Node.js",
        "Express",
        "Frontend",
        "UI/UX",
        "Requirement Gathering"
      ]
    }
  ],
  "projects": [
    {
      "name": "0xPortfolio",
      "summary": "Personal portfolio showcasing professional journey, skills, and a curated collection of projects and experiences.",
      "category": ["WebDev"],
      "url": "https://github.com/ashish-kus/0xPortfolio",
      "imageUrl": "",
      "techstack": ["JavaScript"],
      "details": [
        "Built as a centralized portfolio to present projects, skills, and achievements in a structured way for recruiters and collaborators.",
        "Implements a modern web UI to highlight key work with clear navigation and sections tailored for a software developer profile."
      ]
    },
    {
      "name": "0xResume",
      "summary": "Automated resume build system that dynamically updates and syncs across cloud environments.",
      "category": ["DevOps", "Automation"],
      "url": "https://github.com/ashish-kus/0xResume",
      "imageUrl": "",
      "techstack": ["TeX", "DevOps tooling"],
      "details": [
        "Uses LaTeX and automation workflows to generate resumes from a single source of truth, reducing manual edits.",
        "Designed to sync and update resumes reliably across environments, enabling consistent profile updates for different use cases."
      ]
    },
    {
      "name": "OpenAI_SDK_Research_Assistant",
      "summary": "Research assistant that uses the OpenAI SDK to automate web research, generate reports, and compare them with existing documents.",
      "category": ["AI", "WebDev"],
      "url": "https://github.com/ashish-kus/OpenAI_SDK_Research_Assistant",
      "imageUrl": "",
      "techstack": ["Python", "OpenAI SDK"],
      "details": [
        "Automates web research workflows and compiles findings into structured, human-readable reports.",
        "Supports document comparison to highlight differences and similarities between new research outputs and existing material."
      ]
    },
    {
      "name": "SupportAI-Voice",
      "summary": "Voice-enabled RAG system that lets users query their PDFs using speech through an OpenAI SDK and Streamlit-based interface.",
      "category": ["AI", "WebDev"],
      "url": "https://github.com/ashish-kus/SupportAI-Voice",
      "imageUrl": "",
      "techstack": ["Python", "Streamlit", "OpenAI SDK"],
      "details": [
        "Enables users to upload PDF documents and ask voice-based questions, returning context-aware answers from the content.",
        "Demonstrates a Retrieval-Augmented Generation pipeline integrating audio input, document retrieval, and LLM responses."
      ]
    },
    {
      "name": "ContextPDF",
      "summary": "Multi-PDF chatbot that allows users to upload several PDFs and chat with them using context-aware question answering.",
      "category": ["AI", "WebDev"],
      "url": "https://github.com/ashish-kus/ContextPDF",
      "imageUrl": "",
      "techstack": ["Python"],
      "details": [
        "Implements PDF ingestion and context retrieval to power conversational queries over multiple documents.",
        "Provides a chat interface tailored to explore, summarize, and clarify information contained across PDFs."
      ]
    },
    {
      "name": "ProxyMe-",
      "summary": "Mini AI agent that acts as a proxy version of the author and responds to queries on their behalf.",
      "category": ["AI", "WebDev"],
      "url": "https://github.com/ashish-kus/ProxyMe-",
      "imageUrl": "",
      "techstack": ["JavaScript"],
      "details": [
        "Designed to answer questions as if they were coming from the author, based on predefined logic and data.",
        "Explores the idea of personal AI agents tailored to an individual's preferences and information."
      ]
    },
    {
      "name": "0xBlogs",
      "summary": "Technical blog site documenting learnings and insights in software, Linux, and cloud development.",
      "category": ["WebDev", "Linux", "Cloud"],
      "url": "https://github.com/ashish-kus/0xBlogs",
      "imageUrl": "",
      "techstack": ["HTML", "Hugo"],
      "details": [
        "Organizes technical articles focused on efficient software engineering, Linux workflows, and cloud tooling.",
        "Uses a static-site setup to publish posts with minimal overhead and fast load times."
      ]
    },
    {
      "name": "Devops-automation",
      "summary": "DevOps-focused automation utilities implemented in C++.",
      "category": ["DevOps", "Automation"],
      "url": "https://github.com/ashish-kus/Devops-automation",
      "imageUrl": "",
      "techstack": ["C++"],
      "details": [
        "Contains scripts and tools to automate repetitive DevOps and infrastructure-related tasks.",
        "Targets improved reliability and reduced manual intervention in development and deployment workflows."
      ]
    },
    {
      "name": "dotfiles",
      "summary": "Bare-repo managed dotfiles for consolidating Linux configuration in a single place.",
      "category": ["Linux"],
      "url": "https://github.com/ashish-kus/dotfiles",
      "imageUrl": "",
      "techstack": ["Shell", "Git"],
      "details": [
        "Uses a bare Git repository approach to track configuration files across the Linux system without clutter.",
        "Centralizes window manager, shell, editor, and other environment customizations for reproducible setups."
      ]
    },
    {
      "name": "Huegen",
      "summary": "Fast C++ wallpaper color extractor and theming engine using K-means and perceptual color analysis.",
      "category": ["Linux"],
      "url": "https://github.com/ashish-kus/Huegen",
      "imageUrl": "https://github.com/ashish-kus/Huegen/blob/main/Previews/1.png?raw=true",
      "techstack": [
        "C++ 17",
        "OpenCV",
        "Bash",
        "nlohmann/json",
        "CMake",
        "Linux sockets"
      ],
      "details": [
        "Extracts dominant and visually distinct colors from images using K-means clustering and LAB color space.",
        "Generates multi-format color schemes and theme files via a template engine to style terminals, TTYs, and Linux apps."
      ]
    },
    {
      "name": "LoomFox",
      "summary": "JavaScript-based HD screen and camera recorder to capture video content together.",
      "category": ["WebDev"],
      "url": "https://github.com/ashish-kus/LoomFox",
      "imageUrl": "",
      "techstack": ["JavaScript"],
      "details": [
        "Provides a browser-based interface to record screen and webcam in high definition simultaneously.",
        "Focuses on a simple UX for quick recording sessions suitable for demos, tutorials, and walkthroughs."
      ]
    },
    {
      "name": "Learning",
      "summary": "Consolidated repository for computer science learning materials and experiments.",
      "category": ["Education"],
      "url": "https://github.com/ashish-kus/Learning",
      "imageUrl": "",
      "techstack": ["Python", "Miscellaneous CS tools"],
      "details": [
        "Organizes algorithms, data structures, and other CS-related exercises used for ongoing study.",
        "Acts as a sandbox for practicing concepts, patterns, and language features."
      ]
    },
    {
      "name": "ashish-kus",
      "summary": "Personal profile repository used for the GitHub profile README and related assets.",
      "category": ["Meta"],
      "url": "https://github.com/ashish-kus/ashish-kus",
      "imageUrl": "",
      "techstack": [],
      "details": [
        "Serves as the main entry point for customizing the GitHub profile page via README content.",
        "May host badges, links, and highlights about projects and activities."
      ]
    },
    {
      "name": "devops-directive-github-actions-course",
      "summary": "Course companion repository for learning GitHub Actions from DevOps Directive.",
      "category": ["DevOps"],
      "url": "https://github.com/ashish-kus/devops-directive-github-actions-course",
      "imageUrl": "",
      "techstack": ["Python", "GitHub Actions"],
      "details": [
        "Includes workflows and examples aligned with the GitHub Actions: Beginner to Pro course.",
        "Used to practice CI/CD concepts, triggers, and automation patterns on GitHub."
      ]
    },
    {
      "name": "wallpaper-select-beta",
      "summary": "Keyboard-friendly wallpaper picker built with PySide6 for Linux desktops.",
      "category": ["Linux"],
      "url": "https://github.com/ashish-kus/wallpaper-select-beta",
      "imageUrl": "",
      "techstack": ["Python", "PySide6"],
      "details": [
        "Provides a minimal UI to quickly browse and select wallpapers using primarily keyboard navigation.",
        "Designed to integrate smoothly into tiling window manager workflows."
      ]
    },
    {
      "name": "xstow",
      "summary": "Unofficial fork of xstow with extra patches, including support for newer GCC versions.",
      "category": ["Linux"],
      "url": "https://github.com/ashish-kus/xstow",
      "imageUrl": "",
      "techstack": ["Roff", "C tooling"],
      "details": [
        "Maintains and extends the xstow symlink farm manager with additional fixes.",
        "Includes patches such as compatibility updates for modern compilers."
      ]
    },
    {
      "name": "GDrive-get",
      "summary": "Robust Bash script to download files from Google Drive using share links.",
      "category": ["Linux", "Automation"],
      "url": "https://github.com/ashish-kus/GDrive-get",
      "imageUrl": "",
      "techstack": ["Bash"],
      "details": [
        "Handles Google Drive download URLs and confirmation tokens to reliably fetch large files.",
        "Simplifies non-interactive downloads in scripts, servers, or headless environments."
      ]
    },
    {
      "name": "MetaTrader5_archLinux",
      "summary": "Installer script to set up MetaTrader 5 on Arch Linux.",
      "category": ["Linux"],
      "url": "https://github.com/ashish-kus/MetaTrader5_archLinux",
      "imageUrl": "",
      "techstack": ["Bash"],
      "details": [
        "Automates the installation and configuration of MetaTrader 5 on Arch-based distributions.",
        "Addresses compatibility and environment setup steps typically needed for trading software on Linux."
      ]
    },
    {
      "name": "SEO_metaTag_generater",
      "summary": "Simple HTML tool for generating SEO meta tags for web pages.",
      "category": ["WebDev"],
      "url": "https://github.com/ashish-kus/SEO_metaTag_generater",
      "imageUrl": "",
      "techstack": ["HTML"],
      "details": [
        "Provides a basic interface to construct common SEO meta tags for websites.",
        "Helps developers quickly scaffold metadata without memorizing attribute formats."
      ]
    },
    {
      "name": "rofi-bluetooth",
      "summary": "Rofi-based Bluetooth menu that uses bluetoothctl to manage devices.",
      "category": ["Linux"],
      "url": "https://github.com/ashish-kus/rofi-bluetooth",
      "imageUrl": "",
      "techstack": ["Shell"],
      "details": [
        "Displays a Rofi menu for listing, connecting, and managing Bluetooth devices via bluetoothctl.",
        "Aims to streamline Bluetooth interactions in tiling window manager and keyboard-centric setups."
      ]
    },
    {
      "name": "SOICT-Latex-Kit",
      "summary": "Modular LaTeX thesis system tailored for Gautam Buddha University to streamline academic writing.",
      "category": ["Education", "LaTeX"],
      "url": "https://github.com/ashish-kus/SOICT-Latex-Kit",
      "imageUrl": "",
      "techstack": ["TeX"],
      "details": [
        "Provides a custom LaTeX class and templates aligned with GBU thesis requirements.",
        "Supports structured chapters, references, and formatting to reduce setup time for students."
      ]
    },
    {
      "name": "Linux-System-Monitor",
      "summary": "Interactive C++ system monitor and process manager for Linux, forked and customized.",
      "category": ["Linux"],
      "url": "https://github.com/ashish-kus/Linux-System-Monitor",
      "imageUrl": "",
      "techstack": ["C++"],
      "details": [
        "Offers process viewing and management capabilities similar to top/htop with a custom interface.",
        "Fork includes modifications or experiments on top of the original Linux system monitor project."
      ]
    },
    {
      "name": "Sticky-Paper",
      "summary": "Rofi-based minimalist note-taking system optimized for smooth keyboard-first workflow.",
      "category": ["Linux", "Productivity"],
      "url": "https://github.com/ashish-kus/Sticky-Paper",
      "imageUrl": "https://github.com/ashish-kus/Sticky-Paper/raw/main/Preview/preview.png",
      "techstack": ["Shell", "Rofi"],
      "details": [
        "Lets users quickly create, edit, and manage small notes using Rofi menus and simple scripts.",
        "Designed for low-friction note capture integrated into Linux tiling and minimal setups."
      ]
    },
    {
      "name": "Hackfed-org",
      "summary": "Website for the Hackfed community built with JavaScript.",
      "category": ["WebDev"],
      "url": "https://github.com/ashish-kus/Hackfed-org",
      "imageUrl": "",
      "techstack": ["JavaScript"],
      "details": [
        "Implements the Hackfed site with community information, events, and resources.",
        "Focuses on a straightforward web presence for the organization."
      ]
    },
    {
      "name": "lazyvim.config",
      "summary": "Configuration for the LazyVim Neovim distribution.",
      "category": ["Linux", "Editor"],
      "url": "https://github.com/ashish-kus/lazyvim.config",
      "imageUrl": "",
      "techstack": ["Lua", "Neovim"],
      "details": [
        "Customizes LazyVim with plugins, keymaps, and settings tailored to the author's workflow.",
        "Serves as a reusable Neovim configuration that can be cloned and used on new machines."
      ]
    },
    {
      "name": "MiniSthetic_Firefox",
      "summary": "Minimalist dark theme for Firefox focused on simplicity and elegance.",
      "category": ["Linux", "Theming"],
      "url": "https://github.com/ashish-kus/MiniSthetic_Firefox",
      "imageUrl": "",
      "techstack": ["CSS"],
      "details": [
        "Applies subtle dark styling to Firefox for a clean browsing experience.",
        "Designed to complement minimal Linux desktop setups and reduce visual noise."
      ]
    },
    {
      "name": "linux-script-utility-library",
      "summary": "Collection of Linux scripts to simplify and automate everyday tasks.",
      "category": ["Linux", "Automation"],
      "url": "https://github.com/ashish-kus/linux-script-utility-library",
      "imageUrl": "",
      "techstack": ["Shell"],
      "details": [
        "Provides reusable shell utilities for system maintenance, productivity, and quality-of-life tasks.",
        "Intended to be modular and customizable for different user environments."
      ]
    },
    {
      "name": "waybar-updates",
      "summary": "Waybar module to display Arch Linux updates from official repos and AUR.",
      "category": ["Linux"],
      "url": "https://github.com/ashish-kus/waybar-updates",
      "imageUrl": "",
      "techstack": ["Shell"],
      "details": [
        "Checks for system updates and shows counts in a Waybar segment for quick visibility.",
        "Supports both official repositories and Arch User Repository packages."
      ]
    },
    {
      "name": "dotmaster",
      "summary": "Dotfiles manager intended for everyone.",
      "category": ["Linux"],
      "url": "https://github.com/ashish-kus/dotmaster",
      "imageUrl": "",
      "techstack": ["Shell"],
      "details": [
        "Provides a framework for managing and deploying dotfiles across machines.",
        "Aims to make configuration management more approachable for users new to dotfiles."
      ]
    },
    {
      "name": "thermal_daemon",
      "summary": "Fork of Intel's thermal daemon for IA platforms.",
      "category": ["Linux"],
      "url": "https://github.com/ashish-kus/thermal_daemon",
      "imageUrl": "",
      "techstack": ["C++"],
      "details": [
        "Manages thermal policies on Intel architectures to balance performance and temperature.",
        "Fork used for experimentation or integration with the author's Linux setups."
      ]
    }
  ],

  "skills": {
    "languages": [
      "C++",
      "C",
      "Bash",
      "JavaScript",
      "Python",
      "Go",
      "Lua",
      "LaTeX",
      "HTML",
      "CSS"
    ],
    "frameworks": ["ReactJS", "FXTUI", "TailwindCSS", "Chrome Extensions"],
    "databases": ["MySQL", "MongoDB"],
    "tools": [
      "SEO",
      "AWS",
      "QEMU",
      "Linux",
      "Git",
      "GitHub",
      "GitHub Actions",
      "Docker",
      "nginx",
      "Arch",
      "Ubuntu",
      "nVim",
      "cPanel"
    ],
    "softSkills": [
      "Effective Communication",
      "Problem-Solving",
      "Leadership",
      "Adaptability",
      "Team Collaboration"
    ]
  },

  "certificates": [
    {
      "title": "Introduction to Oracle Cloud Essentials",
      "summery": "Gained foundational understanding of cloud computing through Oracle Cloud Infrastructure. Learned to provision and manage compute instances, object storage, and networking components. Demonstrated knowledge of IAM, compartments, and cost management within OCI.",
      "issuer": "Oracle",
      "issueDate": "Jun 2025",
      "credentialId": "115954",
      "credentialUrl": "https://example.com/oracle-cloud-essentials",
      "logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/50/Oracle_logo.svg/512px-Oracle_logo.svg.png",
      "skills": [
        "Cloud Computing",
        "Cloud Storage",
        "Oracle Applications",
        "Oracle Database",
        "Cloud Security",
        "Software as a Service (SaaS)",
        "Platform as a Service (PAAS)",
        "Oracle Enterprise Resource Planning (ERP) Cloud",
        "Oracle Cloud"
      ]
    },
    {
      "title": "Introduction to Linux (LFS101)",
      "summery": "Completed the Linux 101 course by The Linux Foundation, covering fundamental Linux concepts including file system hierarchy, process management, permissions, shell scripting, and basic networking. Gained hands-on experience with command-line tools and system administration tasks in a Linux environment.",
      "issuer": "The Linux Foundation",
      "issueDate": "May 2025",
      "credentialId": "LF-vcoky5987",
      "credentialUrl": "https://example.com/linux-foundation-lfs101",
      "logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/35/Linux_Foundation_logo.svg/512px-Linux_Foundation_logo.svg.png",
      "skills": [
        "Bash",
        "Networking",
        "System Administration",
        "Linux System Administration",
        "Network Security",
        "Network File System (NFS)",
        "IT Operations"
      ]
    },
    {
      "title": "CVR 2025 Research Paper Presentation Certificate",
      "issuer": "Training and Placement Cell, NIT Goa",
      "summery": "Authored and published a research paper focused on optimizing CPU instruction issue (CPII) frequency scaling to enhance energy efficiency and performance in modern processors. The paper presents analytical models and experimental results demonstrating dynamic scaling strategies for reducing power consumption while maintaining processing throughput.",
      "issueDate": "Apr 2025",
      "credentialId": "SCRS|CVR2025|PC|1134",
      "credentialUrl": "https://example.com/cvr-research-certificate",
      "logo": "https://upload.wikimedia.org/wikipedia/en/thumb/9/91/NIT_Goa_Logo.svg/512px-NIT_Goa_Logo.svg.png",
      "skills": ["Research and Development (R&D)"]
    }
  ],
  "certificationsAchievements": [
    "Published research paper titled “Adaptive Task-Based CPU Scaling for Efficient Power Allocation in Edge Computing.”",
    "Introduction to Linux (LFS101) covering core Linux system and various command-line fundamentals by The Linux Foundation.",
    "Earned the Hacktoberfest 2024 Badges, published multiple packages on AUR.",
    "Winner of multiple hackathons, like Bhabha Bandhu by Microsoft, Glitch pan-India Hackathon on open source development.",
    "Founder of Hackfed tech community and secretary of Techno Cultural Club and Ecell Gautam Buddha University."
  ]
}
